load_test.yml
# Signal Catcher — Artillery
#
# Tres escenarios (pesos 60 / 30 / 10), alineado al brief de mezcla de eventos:
# 1) Solo impresiones — 1 POST por iteración.
# 2) Embudo impresión → click — mismos impression_id y session_id; 2 POST por iteración.
# 3) Embudo impresión → click → conversión — ids encadenados; 3 POST por iteración.
#
# Nota: los escenarios 2 y 3 emiten más peticiones HTTP por iteración que el modelo
# “un solo POST por escenario”; si medís RPS en el API, el total de requests sube
# respecto al mismo arrivalRate con solo requests sueltos.

config:
  target: 'http://localhost:8000'
  processor: './load_test_processor.js'
  phases:
    # Brief: 5 min por tier — subí arrivalRate a 500/1000 según el nivel.
    - duration: 300
      arrivalRate: 100

scenarios:
  - name: 'Solo impresiones'
    weight: 60
    flow:
      - post:
          beforeRequest: 'setEventContext'
          url: '/api/events/impression'
          json:
            impression_id: '{{ $randomString() }}'
            user_ip: '192.168.1.1'
            user_agent: 'Mozilla/5.0'
            timestamp: '{{ timestamp }}'
            state: '{{ state }}'
            search_keywords: 'running shoes'
            session_id: '{{ $randomString() }}'
            ads:
              - advertiser:
                  advertiser_id: 'adv-001'
                  advertiser_name: 'Nike'
                campaign:
                  campaign_id: 'camp-001'
                  campaign_name: 'Fall 2026'
                ad:
                  ad_id: 'ad-001'
                  ad_name: 'Air Max'
                  ad_text: 'Test'
                  ad_link: 'http://example.com'
                  ad_position: 1
                  ad_format: 'banner'

  - name: 'Embudo impresión → click'
    weight: 30
    flow:
      - function: 'initImpressionClickFunnel'
      - post:
          beforeRequest: 'funnelTimestamp'
          url: '/api/events/impression'
          json:
            impression_id: '{{ impId }}'
            user_ip: '192.168.1.1'
            user_agent: 'Mozilla/5.0'
            timestamp: '{{ timestamp }}'
            state: '{{ state }}'
            search_keywords: 'running shoes'
            session_id: '{{ sessionId }}'
            ads:
              - advertiser:
                  advertiser_id: 'adv-001'
                  advertiser_name: 'Nike'
                campaign:
                  campaign_id: 'camp-001'
                  campaign_name: 'Fall 2026'
                ad:
                  ad_id: 'ad-001'
                  ad_name: 'Air Max'
                  ad_text: 'Test'
                  ad_link: 'http://example.com'
                  ad_position: 1
                  ad_format: 'banner'
      - post:
          beforeRequest: 'funnelTimestamp'
          url: '/api/events/click'
          json:
            click_id: '{{ clickId }}'
            impression_id: '{{ impId }}'
            timestamp: '{{ timestamp }}'
            clicked_ad:
              ad_id: 'ad-001'
              ad_position: 1
              click_coordinates:
                x: 250
                y: 400
                normalized_x: 0.65
                normalized_y: 0.80
              time_to_click: 5.2
            user_info:
              user_ip: '192.168.1.1'
              state: '{{ state }}'
              session_id: '{{ sessionId }}'

  - name: 'Embudo impresión → click → conversión'
    weight: 10
    flow:
      - function: 'initFullFunnel'
      - post:
          beforeRequest: 'funnelTimestamp'
          url: '/api/events/impression'
          json:
            impression_id: '{{ impId }}'
            user_ip: '192.168.1.1'
            user_agent: 'Mozilla/5.0'
            timestamp: '{{ timestamp }}'
            state: '{{ state }}'
            search_keywords: 'running shoes'
            session_id: '{{ sessionId }}'
            ads:
              - advertiser:
                  advertiser_id: 'adv-001'
                  advertiser_name: 'Nike'
                campaign:
                  campaign_id: 'camp-001'
                  campaign_name: 'Fall 2026'
                ad:
                  ad_id: 'ad-001'
                  ad_name: 'Air Max'
                  ad_text: 'Test'
                  ad_link: 'http://example.com'
                  ad_position: 1
                  ad_format: 'banner'
      - post:
          beforeRequest: 'funnelTimestamp'
          url: '/api/events/click'
          json:
            click_id: '{{ clickId }}'
            impression_id: '{{ impId }}'
            timestamp: '{{ timestamp }}'
            clicked_ad:
              ad_id: 'ad-001'
              ad_position: 1
              click_coordinates:
                x: 250
                y: 400
                normalized_x: 0.65
                normalized_y: 0.80
              time_to_click: 5.2
            user_info:
              user_ip: '192.168.1.1'
              state: '{{ state }}'
              session_id: '{{ sessionId }}'
      - post:
          beforeRequest: 'funnelTimestamp'
          url: '/api/events/conversion'
          json:
            conversion_id: '{{ convId }}'
            click_id: '{{ clickId }}'
            impression_id: '{{ impId }}'
            timestamp: '{{ timestamp }}'
            conversion_type: 'purchase'
            conversion_value: 59.99
            conversion_currency: 'USD'
            conversion_attributes:
              order_id: '{{ $randomString() }}'
              items:
                - product_id: 'prod-001'
                  quantity: 1
                  unit_price: 59.99
            attribution_info:
              time_to_convert: 900
              attribution_model: 'last_click'
            user_info:
              user_ip: '192.168.1.1'
              state: '{{ state }}'
              session_id: '{{ sessionId }}'